```hcl
05:03:33.373 INFO   The runner at . will be processed in the following order for command plan:
Group 1
- Unit ./ecr
- Unit ./eventbridge
- Unit ./iam
- Unit ./iam-policy
- Unit ./s3

Group 2
- Unit ./iam-user


module.ecr["medvista-utilities-mongodb"].data.aws_partition.current: Reading...
module.ecr["healthcare_identityservice"].data.aws_caller_identity.current: Reading...
module.ecr["hellow"].data.aws_partition.current: Reading...
module.ecr["hellow"].data.aws_caller_identity.current: Reading...
module.ecr["healthcare_patientservice"].data.aws_caller_identity.current: Reading...
module.ecr["medvista-utilities-mongodb"].data.aws_caller_identity.current: Reading...
module.ecr["new"].data.aws_caller_identity.current: Reading...
module.ecr["medvista-utilities-postgresql"].data.aws_caller_identity.current: Reading...
module.ecr["healthcare_patientservice"].data.aws_partition.current: Reading...
module.ecr["healthcare_identityservice"].data.aws_partition.current: Reading...
module.ecr["hellow"].data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr["medvista-utilities-mongodb"].data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr["healthcare_patientservice"].data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr["healthcare_identityservice"].data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr["new"].aws_ecr_repository.this[0]: Refreshing state... [id=new]
module.ecr["new"].data.aws_partition.current: Reading...
module.ecr["medvista-utilities-postgresql"].data.aws_partition.current: Reading...
module.ecr["healthcare_identityservice"].aws_ecr_repository.this[0]: Refreshing state... [id=healthcare_identityservice]
module.ecr["medvista-utilities-postgresql"].data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr["new"].data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr["medvista-utilities-postgresql"].aws_ecr_repository.this[0]: Refreshing state... [id=medvista-utilities-postgresql]
module.ecr["medvista-utilities-mongodb"].aws_ecr_repository.this[0]: Refreshing state... [id=medvista-utilities-mongodb]
module.iam_policy["psp-1-backup-s3"].aws_iam_policy.policy[0]: Refreshing state... [id=arn:aws:iam::587210147621:policy/psp-1-backup-s3]
module.iam_policy["ecr_user"].aws_iam_policy.policy[0]: Refreshing state... [id=arn:aws:iam::587210147621:policy/ecr_user]
module.ecr["healthcare_identityservice"].data.aws_caller_identity.current: Read complete after 0s [id=587210147621]
module.ecr["hellow"].aws_ecr_repository.this[0]: Refreshing state... [id=hellow]
module.psp_1_backup_iam_user.aws_iam_user.this[0]: Refreshing state... [id=psp-1-backup]
module.psp_1_backup_iam_policy.aws_iam_policy.policy[0]: Refreshing state... [id=arn:aws:iam::587210147621:policy/psp-1-backup]
module.eventbridge["medvista-utilities-postgresql"].aws_cloudwatch_event_rule.cloudwatch_event_rule: Refreshing state... [id=medvista-utilities-postgresql]
aws_iam_policy.iam_policy: Refreshing state... [id=arn:aws:iam::587210147621:policy/ecr-image-push-event]
module.eventbridge["new"].aws_cloudwatch_event_rule.cloudwatch_event_rule: Refreshing state... [id=new]
aws_iam_role.iam_role: Refreshing state... [id=ecr-image-push-event]
module.eventbridge["medvista-utilities-mongodb"].aws_cloudwatch_event_rule.cloudwatch_event_rule: Refreshing state... [id=medvista-utilities-mongodb]
aws_cloudwatch_event_connection.cloudwatch_event_connection: Refreshing state... [id=ecr-image-push-event]
module.eventbridge["healthcare_identityservice"].aws_cloudwatch_event_rule.cloudwatch_event_rule: Refreshing state... [id=healthcare_identityservice]
module.eventbridge["hellow"].aws_cloudwatch_event_rule.cloudwatch_event_rule: Refreshing state... [id=hellow]
module.psp_1_backup_iam_user.aws_iam_access_key.this_no_pgp[0]: Refreshing state... [id=AKIAYRODTY4S3BO6XS2E]
module.ecr["new"].data.aws_caller_identity.current: Read complete after 1s [id=587210147621]
module.psp_1_backup_iam_user.aws_iam_user_policy_attachment.this["0"]: Refreshing state... [id=psp-1-backup-20260108073702379100000001]
module.s3_bucket.data.aws_region.current: Reading...
module.s3_backup_bucket.data.aws_caller_identity.current: Reading...
module.s3_bucket.data.aws_caller_identity.current: Reading...
module.s3_backup_bucket.data.aws_region.current: Reading...
module.s3_bucket.data.aws_partition.current: Reading...
module.s3_backup_bucket.data.aws_partition.current: Reading...
module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=psp-1-tfstate]
module.s3_backup_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=psp-1-backup]
module.s3_bucket.data.aws_region.current: Read complete after 0s [id=ap-south-1]
module.s3_backup_bucket.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_bucket.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_backup_bucket.data.aws_region.current: Read complete after 0s [id=ap-south-1]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
aws_iam_role_policy_attachment.iam_role_policy_attachment: Refreshing state... [id=ecr-image-push-event/arn:aws:iam::587210147621:policy/ecr-image-push-event]
module.ecr["medvista-utilities-postgresql"].data.aws_caller_identity.current: Read complete after 1s [id=587210147621]
module.s3_bucket.data.aws_caller_identity.current: Read complete after 0s [id=587210147621]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
module.ecr["healthcare_patientservice"].data.aws_caller_identity.current: Read complete after 1s [id=587210147621]
module.ecr["hellow"].data.aws_caller_identity.current: Read complete after 1s [id=587210147621]
module.ecr["medvista-utilities-mongodb"].data.aws_caller_identity.current: Read complete after 1s [id=587210147621]
module.s3_backup_bucket.data.aws_caller_identity.current: Read complete after 0s [id=587210147621]
module.eventbridge["new"].aws_cloudwatch_event_api_destination.cloudwatch_event_api_destination: Refreshing state... [id=new]
module.eventbridge["healthcare_identityservice"].aws_cloudwatch_event_api_destination.cloudwatch_event_api_destination: Refreshing state... [id=healthcare_identityservice]
module.eventbridge["medvista-utilities-mongodb"].aws_cloudwatch_event_api_destination.cloudwatch_event_api_destination: Refreshing state... [id=medvista-utilities-mongodb]
module.eventbridge["hellow"].aws_cloudwatch_event_api_destination.cloudwatch_event_api_destination: Refreshing state... [id=hellow]
module.eventbridge["medvista-utilities-postgresql"].aws_cloudwatch_event_api_destination.cloudwatch_event_api_destination: Refreshing state... [id=medvista-utilities-postgresql]
module.ecr["healthcare_identityservice"].aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=healthcare_identityservice]
module.ecr["medvista-utilities-mongodb"].aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=medvista-utilities-mongodb]
module.ecr["new"].aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=new]
module.ecr["hellow"].aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=hellow]
module.ecr["medvista-utilities-postgresql"].aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=medvista-utilities-postgresql]
module.eventbridge["medvista-utilities-postgresql"].aws_cloudwatch_event_target.cloudwatch_event_target: Refreshing state... [id=medvista-utilities-postgresql-medvista-utilities-postgresql]
module.eventbridge["healthcare_identityservice"].aws_cloudwatch_event_target.cloudwatch_event_target: Refreshing state... [id=healthcare_identityservice-healthcare_identityservice]
module.eventbridge["hellow"].aws_cloudwatch_event_target.cloudwatch_event_target: Refreshing state... [id=hellow-hellow]
module.eventbridge["medvista-utilities-mongodb"].aws_cloudwatch_event_target.cloudwatch_event_target: Refreshing state... [id=medvista-utilities-mongodb-medvista-utilities-mongodb]
module.eventbridge["new"].aws_cloudwatch_event_target.cloudwatch_event_target: Refreshing state... [id=new-new]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecr["healthcare_patientservice"].aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keeps ten tagged images, expires all others"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber    = 10
                          + countType      = "imageCountMoreThan"
                          + tagPatternList = [
                              + "Dev-k8s*",
                            ]
                          + tagStatus      = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keeps ten tagged images, expires all others"
                      + rulePriority = 3
                      + selection    = {
                          + countNumber    = 10
                          + countType      = "imageCountMoreThan"
                          + tagPatternList = [
                              + "QA-k8s*",
                            ]
                          + tagStatus      = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keeps ten tagged images, expires all others"
                      + rulePriority = 4
                      + selection    = {
                          + countNumber    = 10
                          + countType      = "imageCountMoreThan"
                          + tagPatternList = [
                              + "medvista*",
                            ]
                          + tagStatus      = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keeps ten tagged images for custom*, expires all others"
                      + rulePriority = 2147483646
                      + selection    = {
                          + countNumber    = 10
                          + countType      = "imageCountMoreThan"
                          + tagPatternList = [
                              + "manual*",
                            ]
                          + tagStatus      = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Remove all other images older than five days"
                      + rulePriority = 2147483647
                      + selection    = {
                          + countNumber = 5
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + region      = "ap-south-1"
      + registry_id = (known after apply)
      + repository  = "healthcare_patientservice"
    }

  # module.ecr["healthcare_patientservice"].aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "healthcare_patientservice"
      + region               = "ap-south-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Application" = "medcore"
          + "Contacts"    = "pranat.pattankude@corazonkare.com"
          + "Created_By"  = "Terraform"
          + "Owner"       = "terraform"
        }
      + tags_all             = {
          + "Application" = "medcore"
          + "Contacts"    = "pranat.pattankude@corazonkare.com"
          + "Created_By"  = "Terraform"
          + "Owner"       = "terraform"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf-plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf-plan"

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eventbridge["healthcare_patientservice"].aws_cloudwatch_event_api_destination.cloudwatch_event_api_destination will be created
  + resource "aws_cloudwatch_event_api_destination" "cloudwatch_event_api_destination" {
      + arn                              = (known after apply)
      + connection_arn                   = "arn:aws:events:ap-south-1:587210147621:connection/ecr-image-push-event/8f8fc931-135b-49e8-be8d-23eae1ec06d4"
      + description                      = "API Destination for ECR Image Push Events"
      + http_method                      = "POST"
      + id                               = (known after apply)
      + invocation_endpoint              = "https://cd-release.pranat.online/hook/9f48f570ba30dc94b5eeb825744a491cb0249adc4bd5817bc4b996b8fc0648af"
      + invocation_rate_limit_per_second = 10
      + name                             = "healthcare_patientservice"
      + region                           = "ap-south-1"
    }

  # module.eventbridge["healthcare_patientservice"].aws_cloudwatch_event_rule.cloudwatch_event_rule will be created
  + resource "aws_cloudwatch_event_rule" "cloudwatch_event_rule" {
      + arn            = (known after apply)
      + description    = "Rule for ECR Image Push Events"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + action-type     = [
                      + "PUSH",
                    ]
                  + image-tag       = [
                      + {
                          + anything-but = [
                              + "",
                            ]
                        },
                    ]
                  + repository-name = [
                      + "healthcare_patientservice",
                    ]
                  + result          = [
                      + "SUCCESS",
                    ]
                }
              + detail-type = [
                  + "ECR Image Action",
                ]
              + source      = [
                  + "aws.ecr",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "healthcare_patientservice"
      + name_prefix    = (known after apply)
      + region         = "ap-south-1"
      + tags_all       = (known after apply)
    }

  # module.eventbridge["healthcare_patientservice"].aws_cloudwatch_event_target.cloudwatch_event_target will be created
  + resource "aws_cloudwatch_event_target" "cloudwatch_event_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "ap-south-1"
      + role_arn       = "arn:aws:iam::587210147621:role/ecr-image-push-event"
      + rule           = "healthcare_patientservice"
      + target_id      = "healthcare_patientservice"

      + retry_policy {
          + maximum_event_age_in_seconds = 60
          + maximum_retry_attempts       = 0
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf-plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf-plan"
module.s3_backup_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=psp-1-backup]
module.s3_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=psp-1-tfstate]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
module.iam_user["ecr_user"].aws_iam_user.this[0]: Refreshing state... [id=ecr_user]
module.iam_user["psp-1-backup-s3"].aws_iam_user.this[0]: Refreshing state... [id=psp-1-backup-s3]
module.iam_user["psp-1-backup-s3"].aws_iam_user_policy_attachment.this["0"]: Refreshing state... [id=psp-1-backup-s3-20260108072322971200000002]
module.iam_user["ecr_user"].aws_iam_user_policy_attachment.this["0"]: Refreshing state... [id=ecr_user-20260108072322897600000001]
module.iam_user["psp-1-backup-s3"].aws_iam_access_key.this_no_pgp[0]: Refreshing state... [id=AKIAYRODTY4SXB5T46HA]
module.iam_user["ecr_user"].aws_iam_access_key.this_no_pgp[0]: Refreshing state... [id=AKIAYRODTY4S5PD44K6X]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

<!-- thollander/actions-comment-pull-request "file" -->